Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN, MAYA'S WORLD.tmx
Source language: id
Languages: en

source: selamat
en: ...welcome

source: SAYA SAMA DIA...
en: her.

source: TAU YANG
en: to come

source: HARITS INI
en: harist so long?!

source: APAAN
en: what’s

source: Mulai deh.
en: don’t you start...

source: Woi!
en: hey!

source: Radi Mahardhika, 2 Oktober
en: radi mahardika, october 2

source: AKHIR, ISINYA
en: it’s about

source: JAUH-JAUH, CUMA TADI
en: to pick one that is convenient

source: KEMAREN LARAS
en: laras was caught

source: LARAS, SAYA NGGAK TAU GIMANA CARANYA MENGENDALIKAN EMOSI SAYA, HAL INI JUGA BISA MERUGIKAN SEKITAR SAYA, BAHKAN DIRI SAYA SENDIRI… SAYA NGGAK PERNAH SADAR AKAN HAL ITU.
en: laras, when I can’t control my emotions, they can have a negative impact on those around me as well as myself... and I’ve failed to control my emotions in the past.

source: SOAL DIA.
en: about him.

source: MAAF YA,
en: sorry, I shouldn’t have

source: Apakah gue terlalu egois buat bilang…
en: is it too much for me to say...

source: INGET YA
en: You can give

source: Sorry, ganggu tapi gue lagi nyari orang nih.
en: sorry, I’m looking for someone.

source: AJA, NGIBUL
en: you

source: TIBA-TIBA BANGET?!!!
en: like, seriously?!

source: KERETAMU
en: will your train

source: …Iya…
en: sure.

source: ITU MINUM
en: you have to take

source: IRI DEH.
en: I’d be glad if I were you.

source: NGULANG...?
en: re-start your thesis?

source: Kamu mau menyelesaikannya semuanya saat ini juga?
en: you really want to end everything right here and now?

source: SEMUA ORANG PUNYA CITA-CITA.
en: ...chasing their dreams.

source: DATENG NGGAK
en: you

source: OM MAU
en: I have

source: TAHAN....
en: bear with it...

source: IYA, BAHKAN
en: yeah, now

source: TRUS KENAPA LO NGGAK LANGSUNG NGEHUBUNGIN LARAS?!
en: then why didn’t you call her as soon as you got here?!

source: iya ma, jangan capek-capek ya
en: okay, mom. don’t work too hard.

source: PENGALAMANNYA
en: plus, you won’t get

source: Emang bener gue nggak ngerti cara nyetir mobil lo.
en: huh?! I really can’t. I don’t know how to drive your car!

source: MUNGKIN SAYA TERDENGAR SALAH MENGUMPAMAKAN PERASAAN PAKAI ANGKA… TAPI SEMOGA KAMU PAHAM MAKSUD SAYA.
en: I know it doesn’t sound right to compare feelings to numbers, but I hope you get what I mean.

source: Di mana dia…?
en: where’s he?

source: 'KAN?
en: recently.

source: Zona Maya
en: maya’s world

source: kamu terlalu terburu-buru.
en: it’s too rushed.

source: PERNAH BILANG KE
en: anyone

source: SAYANG.
en: baby...

source: SERIUS SAMA
en: speaking with radi.

source: ATAS NAMA
en: and that you’ll say

source: Kita Undang
en: “Let’s invite them

source: DEK KRISPIII!!!
en: my charm!

source: DIGANGGU BANGET
en: we haven’t got

source: TAUNYA
en: instead,

source: BUKANNYA
en: I thought they

source: PENGEN BAHAS
en: can we

source: Bonggol Kayu!
en: beneath a log!

source: JUGA, CUMA
en: version, right?

source: Iya, dia emang penting buat gua.
en: yes, so important.

source: Satu-satunya cara gue menebus rasa bersalah gue…
en: the only way for me to atone for my mistake...

source: YA NYAMPE
en: arrive

source: IPIN!
en: you know?!

source: RADI KAYAKNYA LEBIH SERING LEWAT GERBANG BELAKANG DARIPADA GERBANG DEPAN,
en: he normally uses the back gate,

source: LO KASIH TAU
en: tell mom

source: LUPA
en: maya introduced you

source: IYA, DIA
en: yup,

source: KALO GITU.
en: trip, ma’am!

source: DIEMIN AJA.
en: just don’t pick it up.

source: NGGAK MAU
en: I don’t care

source: ANAK-ANAK
en: our classmates

source: TAU BAGAIMANA
en: to do some

source: NGGAK… SERIUS ITU ADA CICAK TADI…
en: but there was clearly a lizard!

source: NGGAK-NGGAK.
en: idea.

source: NAK, TOTALITAS
en: you all...

source: KETEMU KELUARGA,
en: start my internship,

source: YA!!
en: now!

source: cerita ini adalah fiktif belaka,
en: this is a work of fiction

source: SEJAK DIA DI SURABAYA, SUSAH BANGET BUAT BALES CHAT… BAHKAN TELEPON GUE AJA NGGAK OERNAH DIANGKAT
en: since he moved to surabaya, he hasn’t responded to my texts... or even returned my phone calls.

source: KENAPA KAMU KETAWA?!!
en: why are you laughing?!

source: KITA SELALU MELIHAT SEBUAH HUBUNGAN PACARAN ITU ADALAH HUBUNGAN YANG SALING MELENGKAPI.
en: we always think of a couple as two people who complete each other.

source: KELAS KITA SERING
en: have always seen them

source: DUH KEMANA SIH RADI?!
en: what’s radi doing?!

source: RADI TUH
en: wasn’t true

source: INI KAMU NGGAK
en: if you took a different approach

source: Maaf ya, gua bener-bener gak tau lu bisa sampe kayak gitu gara-gara gua.
en: sorry... I didn’t know that you’d feel that way because of me.

source: ...hah.... kira-kira aku bisa nggak ya...
en: will I be able to do this?

source: LANGSUNG
en: straight to japan

source: Tapi saya belom tau siapa…
en: but I haven’t decided yet.

source: BILANG KE
en: she wanted

source: KARENA SAYA DALAM MENTAL KAYAK GITU, SEMUA YANG SAYA LAKUKAN KACAU BALAU.
en: with a mental state like that, everything I did went wrong.

source: HARUS BALIK
en: go back

source: hormati…
en: gentlemen...

source: SAYA LEBIH SIAP… KARENA PERASAAN MANUSIA ITU SANGAT KOMPLEKS.
en: because, you know, people’s feelings are so complicated.

source: Ada perlu apa lagi?
en: what do you want?

source: BIKIN GRUP KAYAK
en: started something like

source: kenapa sih kamu nggak mau dibantu?!
en: why won’t you let me repay the favor?

source: IBU NGGAK
en: however,

source: WAKTU KAMU TAHU SOAL INTERNSHIPRADI, SAYA EMANG SYOK.
en: the fact that you were aware of radi’s internship was indeed shocking to me.

source: Oh iya dek, sempetin pulang ke Bekasi dulu ya sebelum ke Jepang.
en: before you leave for japan, make sure you return to bekasi first, okay?

source: YAKIN NGGAK
en: you sure

source: aku udah pernah berantem sama maya karena aku terlalu ikut campur urusan dia.
en: maya has never been a fan of people minding her own business,

source: MAMA PENGEN
en: I want to

source: ooh... yo... mumet aku di bandung, jadinya pulang aja deh
en: I’m weary of bandung, so I decided to stay here for now.

source: Dia ada payung gak sih…
en: does she even have an umbrella here?

source: Nomer gak dikenal…?
en: an unknown number?

source: datang di
en: onboard

source: Sampai jumpa lagi!
en: see you soon!

source: DATENG, SOALNYA
en: I’m kinda intrigued

source: Maaf saya udah bikin kamu kayak gini…
en: I’m sorry for making you feel this way.

source: IBU TEMUKAN DI
en: each year, most students here

source: SAYA NGGAK TAU UKURAN ASIK NGGAK ASIKNYA.
en: I don’t know why you’re so excited.

source: TAPI KALO
en: but I’ve got

source: DIBAWA
en: please

source: ndusel ndusel
en: cuddle cuddle

source: SAMA INTERNSHIP
en: on my

source: Geli abis lo
en: ew! what the...

source: SEMANGAT
en: good luck

source: JADINYA
en: now, she has

source: MENGIRA YANG
en: the wrong

source: MATA LARAS.
en: you doofus.

source: YANG PENTING
en: there

source: skripsi maya harus diulang...
en: I have to rework the thesis.

source: Ok… menggenang banget lagi di luar… masa iya gue harus nunggu sampe kelar.
en: damn it, it’s pouring out there! do I really have to wait for them here?!

source: Selamat malam, Larasati Ayudia Kusumaatmadja
en: evening, larasati ayudya kusumaadmadja!

source: neng ayu, punteeen! mau ngasih bingkisan!
en: excuse me, ayu, I’ve got something for you!

source: SIDANG?
en: submit it?

source: NANTI KAMU
en: just send me some pictures,

source: KALO MAYA NGGAK SETUJU MAMA BUAT NYIMPEN FOTO ITU… NANTI KAK AIS BISA BILANG KE MAMA…
en: if you don’t want mom to keep your photo... I’ll talk to her about it.

source: SAMA, KAMI BARENGAN
en: we decided to do it...

source: paling cuma kesalahan minor kan?!
en: there are only some minor things that need to be improved!

source: KHAWATIR
en: to be

source: EH...?
en: oh?

source: Kita refreshing dulu yuk nak?
en: how about we do something fun today?

source: KENAPA GUE
en: so why should I

source: KAMU JUGA
en: by doing so,

source: PANAS SIH
en: hasn’t gone

source: dan aku nggak mau itu kejadian lagi.
en: and I don’t wanna be one of those people.

source: RITUAL ORANG PACARAN NOH BIASANYA.
en: all the couples go there.

source: KALO GAK ADA
en: without

source: LO LAGI TIDUR,
en: up since

source: Atau kamu mau yang ini, nak?
en: let's try this one out!

source: SIH...
en: idea...

source: BU, MAMA SAYA
en: my mom went

source: BIASANYA LANGSUNG NGAJAK NGOBROL…
en: I mean, usually he talks so much.

source: 'KAN KALAU
en: great if we

source: EH…?
en: huh...?

source: NGGAK PERNAH
en: have never again

source: YANG KAMU SINGGUNG
en: to the subject matter

source: BINTANG BAKAL
en: he’d get

source: Lu nggak mau ngulang kejadian yang sama 'kan, Ras?
en: you don’t want to repeat what you did, right, laras?

source: Gue mau ngecek kamar itu sekarang, kalian urus penghuni yang seenaknya tinggal di unit eksklusif gue!!!
en: I want to see the room! you take care of the pesky tenants who have been living in there!

source: ...LIAT?
en: “watching”?

source: SAMPE HARUS DIUMPETIN DI ATAS?!!
en: that they had to hide it at the top, huh?!

source: Tapi mama penasaran juga sih, belom pernah jahit pakai bahan ini…
en: hmm... but I’ve never sewed this kind of material before.

source: Gua nggak bakal nemuin lu kayak gini lagi, gua bakal fokus sama masa depan gua.
en: ...I promise to stop seeing you like this. I will focus on what lies ahead for me.

source: UJANNYA
en: the rain

source: kamu kira kamu bisa menyelesaikan masalah kamu sendiri?!
en: do you really think you can always handle everything on your own?!

source: MESIN, IBU JADI
en: these days. well,

source: AKU TAKUT KARENA AKU MERASA AKU NGGAK BISA NERUSIN HUBUNGANKU SAMA LARAS LAGI.
en: I’m afraid I can’t be with laras anymore.

source: BANTUIN BERESIN
en: to take care

source: FEELING SAYA WAKTU DIAJAK KE PASAR BARU ITU BENER…
en: so, when she took me to pasar baru, my suspicions were right...

source: …Hah?
en: what...?

source: …STRUGGLE SAYA DAN BINTANG KURANG LEBIH SAMA YA…?
en: bintang and I are both going through the same problem...

source: KELAS 3 ADALAH MASA-MASA SEMUA ORANG
en: when everyone reached the final year of high school,

source: TEH ULFA
en: ulfa said

source: DOANG, PAHAM?!
en: okay?!

source: H...
en: um...

source: Maka dari itu gua milih buat menjaga perasaan gua buat dia, karena dia sepenting itu buat gua.
en: therefore, I decided to keep my feelings for her because she was that special.

source: BENER-BENER KAYAK ORANG PATAH HATI.
en: she really looks like a heartbroken girl.

source: WAH RAS!
en: whoa!

source: HARI, KITA KE
en: we need to see

source: DIA KAYAKNYA
en: he seemed

source: kamu pintar, cepat tanggap dalam materi kuliah apa pun, nilai kamu selalu sempurna...
en: listen, you’re intelligent and a quick learner. your grades have always been excellent.

source: GUA MASIH ADA
en: I need to

source: um... kamu kenapa...?
en: um... are you okay?

source: JADINYA SAYA
en: and, I’ve got to

source: SOAL BISA
en: if I can make it

source: BERMACAM-MACAM.
en: their research.

source: APA PUN DAN
en: no matter

source: DAN KITA HARUS
en: so we must

source: SAYA BIMBINGAN
en: I kinda have a lot

source: BOKAP SOAL
en: about

source: Saya ada urusan.
en: I’m busy.

source: DI SKRIPSI
en: while working on

source: GUA LAGI
en: I really

source: haah...
en: huff...

source: SAYA BELOM
en: I haven’t made

source: SUUDZON AJA
en: accused him

source: asik!
en: yay!

source: DONG?
en: man?

source: OH KAMU… MAKASIH.
en: oh... thanks.

source: GITU.
en: that?!

source: SAMPAI
en: it makes me

source: LIBUR KULIAH
en: semester

source: gua mau minta tolong sama lu.
en: I need a favor.

source: TAPI RAME BANGET ANJIR!
en: but it’s so crowded!

source: Waktu itu, gua bener-bener ngambil jalan tengah yang menurut gua itu adil, gua mau ngejaga perasaan gua, mau gak mau gua harus tegas sama perasaan gua sendiri.
en: at that time, I decided to be as fair as possible. I wanted to stay in the middle. I had no choice but to stand firm in my feelings for her if I wanted to keep them.

source: Oh… nggak, gua mau minta tolong aja, boleh gak?
en: it’s nothing. I just want to ask you a favor.

source: WAKTU KITA KE KAMPUS LO ITU, GUE LARI KARENA KITTY UDAH NYAMPERIN GUE KE SANA.
en: I ran when we got to your campus because I knew kitty was there.

source: BUAT GUE...
en: to me.

source: ZREG
en: stomp

source: DI PENELITIAN TUGAS
en: for my thesis,

source: NYARI ORANG YANG
en: was also looking for him,

source: CARI TAHU, BUKAN
en: let’s put aside

source: Tak nyaman
en: and nervous...

source: SORI RAD,
en: sorry, radi...

source: episode 72 Yang Ingin Dipertahankan
en: episode 72 things that you want to keep around

source: YA, BYE.
en: bye.

source: DIA BENER-BENER UDAH TAHU KEBERADAAN LO YA…
en: I’m starting to think he knows where you are at all times.

source: BADMOOD
en: just in a bad mood,

source: BAGAIMANAPUN, LARAS HARUS TAHU APA YANG KAMU RASAKAN SAAT INI.
en: nevertheless, laras deserves to know how you feel.

source: DI MEJA UDAH ADA MAKAN MALEM, DIABISIN AJA YA KAK AIS UDAH KENYANG.
en: dinner’s on the table. I’ve already had mine.

source: tapi kenapa kamu nggak membiarkan saya buat melakukan yang sebaliknya buat kamu?
en: but why won’t you let me do the same thing for you?

source: Apa emang ini yang harus lu korbanin demi ngelarin masalah di diri lu?
en: is this really what it takes for you to mend and improve yourself?

source: Hehehe… Oke dech kang!
en: hahaha... I will!

source: nggak pernah benar-benar bertanya...
en: I’ve never asked myself...

source: YANG KURANG
en: the group

source: Mama harus ke rumah sakit, nanti mama telepon lagi ya dek.
en: I need to go to the hospital. I’ll call you later, okay?

source: ini tuh ngulang loh maaay, ngulang skripsiii!!!
en: you need to start over, maya! from scratch!

source: YA?!
en: radi, right?

source: PIKIRIN JUGA
en: make sure

source: SEBELUMNYA SAYA
en: my previous thesis,

source: BIARKAN
en: we should

source: Ras, kamu nggak usah peduliin aku, aku pengennya kamu fokus sama diri kamu sendiri.
en: look, you don’t have to worry about me, okay? just take care of yourself.

source: Gue ambilin mantel lo, abis ini terserah lo mau ngapain, gue lagi nggak bisa diganggu.
en: I’m gonna get your coat for you. after that, you can do whatever you want. just don’t bother me.

source: MOBIL LO.
en: yesterday.

source: PUN SOAL
en: about

source: ABIS UJAN-UJANAN
en: in the rain

source: Kalo tau selama ini, gue duluan aja tadi yang ngobrol.
en: had I known that it would take this long, I would’ve talked to him first.

source: KABARIN YA
en: you know

source: WAH… KITA NGGAK KEPIKIRAN BUAT NAYA JUGA SIH RAS…
en: um... we didn’t get a chance to ask him about his address.

source: NANTI PALING
en: well, then,

source: Apa nggak terlalu tipis ya nak?
en: I think it’s a bit too thin...

source: Duh ngobrolin apa sih?!
en: what are they talking about?!

source: padanya
en: before.

source: SEBENTAR LAGI...
en: just a little bit more...

source: BANGET.
en: funny.

source: STASI
en: stati

source: TAP TAP TAP
en: step step step

source: GITU CARA
en: so that’s how you

source: RADI, TRUS KARENA
en: looking for radi. since she

source: ADEK KAMU...
en: I guess...

source: AKU AKHIRNYA MEMINTA LARAS MENYELESAIKAN MASALAHNYA DENGAN RADI, DAN AKHIRNYA DIA BISA SELESAIKAN DENGAN SENDIRINYA.
en: eventually, I asked laras to talk things out with radi. and the good thing was, she was able to get through it on her own.

source: Punten assalamualaikum…
en: I’m coming in...

source: Gua nggak ada cara lain lagi, gua janji kalo lu udah ngasih kejelasan sekali lagi ke gua…
en: I have nothing more to offer. once you give me a thorough explanation...

source: NGULANG DEH...
en: start over now.

source: BANGET NAK?!
en: for you, son!

source: MAU NGADU
en: when they tried

source: -SEMPETNYA!!
en: isn’t

source: GUE RAGU APAKAH GUE HARUS BILANG INI KE LO ATAU NGGAK, TAPI PAS LO BILANG BINTANG BELOM NGEHUBUNGIN LO, GUE JADI KESEL.
en: I wasn’t sure if I should tell you, but when I found out bintang hadn’t gotten in touch with you, I was upset.

source: RAS?
en: in the studio?

source: EH BENTAR,
en: wait,

source: NANTI TELAT.
en: be late, right?

source: DENGAN BEGITU,
en: by doing so,

source: LO TUH BUKANNYA MASIH ADA URUSAN YA SAMA BINTANG?
en: don’t you have to sort things out with bintang?

source: seram yang
en: and scary

source: IYAA TUNGGU SEBENTAR.
en: coming!

source: Kamu kayaknya capek banget, liat itu mata kamu sembab.
en: you seem so exhausted, maya. your eyes are swollen...

source: halo, assalamualaikum? ada apa, ma?
en: hello, mom?

source: JAUH-JAUH, JADI
en: for this observation,

source: Kalo pun gue bisa nerima ini, udah dari dulu gue lakuin, tapi nyatanya gue nggak bisa.
en: if I could, I would’ve done it already. but until now, I can’t.

source: NGANTERIN
en: medicines,

source: BU, SAYA
en: I must

source: ABISIN!!!
en: eat!

source: Kalian pisah gara-gara gue, menurut lo apa gue bisa nyaman-nyaman aja sama hubungan kalian yang udah selesai?
en: you broke up with her because of me. do you think I could rest easy after what I did to you two?

source: Kesehatan mama lagi nggak baik, jadi linda rewel banget kalo mama tiba-tiba kerja sampe kecapean
en: my health hasn’t been doing well lately, so she’s been nagging me whenever I work too much.

source: EMANG GAK BISA
en: too busy in the studio too.

source: LAGI AJA SAMBIL
en: here, perhaps you should

source: Maya, hari ini kamu ada bimbingan?
en: maya, don’t you have an appointment with your advisor?

source: PUTUSKAN, HEHE!
en: from there! hahaha!

source: AJA!
en: for you, okay?

source: ck!! sejak kosan ini dipasangin bel suka banyak orang iseng.
en: tsk! I knew we shouldn’t have installed that doorbell!

source: NGGAK BISA NUTUPIN
en: disappointed

source: MEMAKSA,
en: any longer.

source: AH!!
en: oh!

source: Ras, ini gua… Lu baik-baik aja?
en: laras, it’s me. are you okay?

source: BUKU INI DI
en: in your car

source: ujar Ciak
en: the chick said.

source: ITU SIAPA SIH WIS YANG SAMA LARAS?
en: who was the guy who came with laras earlier?

source: CK!
en: tsk!

source: SEKADAR UNTUK
en: your desire to graduate

source: CERITA SIH...
en: about it yet.

source: DI SEKOLAH...
en: to me at school.

source: MAU IKUT ATAU
en: would

source: Iya…
en: sure...

source: Kamu lebih muda dari saya?!
en: you’re younger than me?!

source: BUKAN DIA
en: who started

source: TADI
en: bintang

source: UDAH
en: are you done

source: Akhirnya setelah sekian lama, saya berhasil menghubungi nomor anda ya...
en: for the first time in a very long time, I could finally reach you by phone...

source: BRUK!
en: puff

source: DAN SEKARANG,
en: now,

source: Kenapa lo nggak mikirin sampe sana sih, Dan?
en: didn’t that cross your mind, at least?

source: SEBENERNYA...
en: actually...

source: HATI BUAT NGURUSIN
en: to take care of

source: SAYA NGGAK MAU FOTONYA ILANG…
en: that picture is irreplaceable.

source: GUE NGGAK AKAN IKUT CAMPUR TAPI TOLONG JANGAN BIKIN LARAS KEBINGUNGAN SENDIRIAN KAYAK GINI.
en: don’t get me wrong. I’m not trying to interfere, but please don’t confuse her.

source: ASIK… MAKAN MAKANAN MAHAL…
en: yay, we get to eat fancy food!

source: UDAH PULANG KE BEKASI DAN HAPENYA KECOPETAN!!!
en: he’s back in bekasi, but his phone was stolen!

source: SUKA BUBUR
en: like

source: NGGAK ADA YANG BOLEH
en: I didn’t let

source: tapi aku ragu-ragu mau ngasih ini ke maya.
en: but I’ve been hesitating giving it back to her.

source: BERPACARAN KARENA KESEPIAN,
en: to fulfill our need for companionship...

source: NENG AYUUU….
en: ayuuu,

source: NYOKAP ATAU
en: and dad

source: AJA.
en: reference.

source: KATA DOSBING SAYA
en: my advisor said

source: ITULAH
en: that’s why

source: YAAMPUN,
en: oh my god!

source: sangat disayangkan kalau kamu pada akhirnya nggak ngasih kesempatan ii ke diri kamu sendiri, nak.
en: it would be a pity to lose the chance to get experience working in teams.

source: BISA AJAA!!
en: ah, stop teasing me.

source: BANGET AMA
en: very worried

source: MALAH MEMBUAT
en: I didn’t realize the pressure

source: Tapi gue akui… melakukan ini menyenangkan, bikin keluarga gue panik sangat menyenangkan.
en: but I’ve got to admit... doing this is fun. knowing that my family is panicking because of me... it’s so fun.

source: KE SAYA NGGAK
en: she wasn’t really

source: bukan hal asing lagi bagi ibu melihat a+ berderet di transkrip nilai kamu...
en: I wouldn’t be more surprised if you had all A’s on your transcript.

source: BUKAN DARI RADI?
en: rather than radi.

source: keberangkatan
en: will depart

source: DARI TADI NGGAK DIJAWAB?
en: he’s not answering his phone.

source: FOTO DI KAMAR MAYA SIAPA YANG BINGKAI?!
en: who framed the picture in my room?

source: AKU, TAPI DARI SISI
en: and all the theories

source: GAK APA-APA
en: don’t mention

source: SELALU KAYAK GITU, PADAHAL WAKTUKU TERUS BERJALAN, DAN AKU NGGAK BISA NGANGGEP WAKTUKU NGGAK TERBATAS… MENURUT KAMU GIMANA, MAYA?
en: I keep doing that even though I know that my time is limited and I can’t fool myself into thinking it’s endless. what should I do, maya?

source: kenapa bu...?
en: why did you choose me?

source: SIH.
en: you know?

source: ANAK SULUNG
en: my son has been

source: TAU, APA YANG TERJADI SAMA GUE
en: anyone know about what happened

source: CARANYA YA?
en: to do this?

source: AJA SIH...
en: that’s all.

source: nggak ada yang kurang, teorinya juga cukup?!!!
en: I think there’s nothing wrong with your thesis! the theories are fine too!

source: SEMUA HARUS
en: I’ve had to

source: Kalo bawahannya kamu mau yang mana?
en: what kind of skirt are you planning to wear for your graduation, maya?

source: DIA SEPERTI UDAH PAHAM SAMA DIRINYA SENDIRI…
en: ...it made her sound like she knew who she was.

source: CARI YANG
en: so find a location

source: KALO
en: if your fever

source: kan bisa sambil duduk?
en: then why don’t you sit down?

source: Saya ke dapur dulu yah kalo gitu.
en: I’ll be in the kitchen if you need anything.

source: DARI RUMAH,
en: from home.

source: JURUSAN KULIAH
en: in her

source: Saya pun… cuma bisa ngelakuin ini… demi ngelindungin Radi...
en: and I’m doing this... for your own sake, to protect you, radi.

source: USAH
en: thought this through,

source: NIH WIS...?
en: that?

source: AKU TERBIASA MENGISI KEKOSONGAN LARAS, AKU NGELAKUINNYA DENGAN SUKARELA.
en: I’ve grown accustomed to cheering her up whenever she feels empty.

source: JANGAN JAUH
en: I don’t want you

source: Apa gue harus nerima semua ini?
en: do I have to accept all of this?

source: yang akan
en: the train

source: DULU GUE PIKIR GUE ADALAH TOKOH CIAK...
en: I used to think that I was the chick...

source: HAHAHA… BUKAN.
en: hahaha... I’m not.

source: LARAS YAAA!
en: of laras, okay?

source: CERITA KE LU
en: everything.

source: LAGI LAH.
en: a month.

source: SOALNYA BENTAR LAGI
en: I'm going home

source: MAMA...
en: mom...

source: FOTO AJA.
en: okay?

source: lho maaa!! kok mati ac ne...
en: mom!!! the AC is not working...

source: ibu nggak ngerti, kamu waktu itu tiba-tiba menghilang.
en: I just don't understand why you suddenly stopped showing up, maya.

source: IBU MAU
en: do you need

source: ....HAH....?
en: huh?

source: GUE SETELAH PEDAL.
en: of being a pedal member.

source: Dan dia terus nungguin gua.
en: but she kept waiting for me.

source: HANYA MENYIKAPI
en: to cope with it

source: BANGET
en: important

source: MAMA DAN PAPA
en: got

source: TIM.
en: porridge.

source: SIDANG KAMU!
en: okay?

source: EH...
en: uh...

source: IH KURANG
en: what?!

source: Saya cuma nggak mau, pas kamu bantuin saya terus, kamu jadi lupa sama kepentingan kamu sendiri.
en: I just don’t want you to put your own needs aside in order to help me.
